public class 类的定义 {
    public static void main(String[] args) {
        /*
        对象与类：1对象是实体需要被创建，类是规范，根据类的定义来创建对象
        对象：表达对象或事件   运行或响应消息
        类：定义事件属性  就是Java中的类型 可以用来定义变量
        ——————————————————————————————————————————————————————————————————————
        对象 = 属性 + 服务

        封装： 数据 + 对数据的操作， 放在一起， 数据不对外公开
        数据： 属性或状态
        操作： 函数
        ——————————————————————————————————————————————————————————————————————
        private
            # 只有这个类内部可以访问
            @ 类内部指类的成员函数和定义初始化
            @ 这个限制是对类的而不是对对象的
            private表示私有，私有的意思就是除了class自己之外，任何人都不可以直接使用
        ——————————————————————————————————————————————————————————————————————
        default
            即不加任何访问修饰符，通常称为“默认访问模式“。该模式下，只允许在同一个包中进行访
　　　　　问。
        ——————————————————————————————————————————————————————————————————————
        protected
            对于子女、朋友来说，就是public的，可以自由使用，没有任何限制，而对于其他的
            外部class，protected就变成private。
        ——————————————————————————————————————————————————————————————————————
        public
            1.public表明该数据成员、成员函数是对所有用户开放的，所有用户都可以直接进行调用
        ——————————————————————————————————————————————————————————————————————
        static
            详细见CSDN:
               https://blog.csdn.net/weixin_43610698/article/details/90734373
        ——————————————————————————————————————————————————————————————————————
        容器类
            private ArrayList<String> notes = new ArrayList<String>();
         容器类与两个类型：
         1.容器类型：ArrayList
         2.元素类型：String

            HashSet<String> a = new HashSet<String>();
         1.集合，不能有重复数据
         2.无序
        ——————————————————————————————————————————————————————————————————————

         */
    }
}
